Table of Contents
 Class SubStructureGeometry
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
SubStructureGeometry
[OpenModelClass("CI.StructModel.Structure.SubStructureGeometry, CI.StructuralElements", "CI.StructModel.Structure.ISubStructureGeometry,CI.BasicTypes")]
public class SubStructureGeometry : OpenObject
Inheritance
object
OpenObject
SubStructureGeometry
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SubStructureGeometry()
Constructor
public SubStructureGeometry()
Properties
 ConnectionPoints
Array of connection points
public List<ReferenceElement> ConnectionPoints { get; set; }
Property Value
List<ReferenceElement>
List of ConnectionPoints
 RealMembers
Array of DesignMemberInSubStructure
public List<DesignMemberInSubStructure> RealMembers { get; set; }
Property Value
List<DesignMemberInSubStructure>
List of DesignMemberInSubStructure
 TheoreticalMembers
Array of DesignMemberInSubStructure
public List<DesignMemberInSubStructure> TheoreticalMembers { get; set; }
Property Value
List<DesignMemberInSubStructure>
List of DesignMemberInSubStructure
 Edit this page